# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров?
#n = int (input())
#m = int (input())
#print ((n + m -1)//n)


# В некоторой школе решили набрать три новых
# # математических класса и оборудовать кабинеты для
# # них новыми партами. За каждой партой может сидеть
# # два учащихся. Известно количество учащихся в
# # каждом из трех классов. Выведите наименьшее
# # число парт, которое нужно приобрести для них.

# n = int (input())
# m = int (input())
# k = int (input())
# print ((n + m + k) // 2 + (n + m + k) % 2)
# #print (n // 2 + m // 2 + k // 2 + n % 2 + m % 2 + k % 2)